examples/shockTube/Allrun
#!/bin/sh

foamCleanTutorials
blockMesh
rm -rf 0
cp -r 0.orig/ 0
setFields

rhoReactingPimpleFoam | tee log.solver

#------------------------------------------------------------------------------
